---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternIntermediateDistanceY
source: html/c432994f-9f65-44eb-b667-439a1c7b5b16.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternIntermediateDistanceY Property

"Intermediate distance on side 2"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemPatternIntermediateDistanceY { get; }
```